Repository: dheerajs2000/air-quality-predictor
Catalog: air_quality_web/lib/l10n/app_*.arb
Languages: kn

# headerTitle
source: Air Quality Checker
kn: ವಾಯು ಗುಣಮಟ್ಟ ಪರಿಶೀಲನೆ

# subtitle
source: Breathe Safer. Live Better.
kn: ಸುರಕ್ಷಿತವಾಗಿ ಉಸಿರೆಳೆ. ಉತ್ತಮವಾಗಿ ಬದುಕಿ.

source: Check Air Quality
kn: ವಾಯು ಗುಣಮಟ್ಟವನ್ನು ಪರಿಶೀಲಿಸಿ

# statusLabel
source: Status: {status}
kn: ಸ್ಥಿತಿ: {status}

source: Switch to English
kn: ಇಂಗ್ಲಿಷ್‌ಗೆ ಬದಲಿಸಿ

source: Switch to Kannada
kn: ಕನ್ನಡಕ್ಕೆ ಬದಲಿಸಿ

# coInfo
source: Carbon Monoxide: A colorless, odorless gas that can be harmful when inhaled in large amounts.
kn: ಕಾರ್ಬನ್ ಮೋನಾಕ್ಸೈಡ್: ಬಣ್ಣವಿಲ್ಲದ, ವಾಸನೆ ಇಲ್ಲದ ಅನಿಲ — ಹೆಚ್ಚು ಉಸಿರಿದರೆ ಹಾನಿಕರ.

# so2Info
source: Sulfur Dioxide: A toxic gas with a pungent smell; causes respiratory issues.
kn: ಸಲ್ಫರ್ ಡಯಾಕ್ಸೈಡ್: ಹಾನಿಕರ ವಾಸನೆ ಹೊಂದಿರುವ ಅನಿಲ; ಉಸಿರಾಟದ ಸಮಸ್ಯೆ ಉಂಟುಮಾಡುತ್ತದೆ.

# no2Info
source: Nitrogen Dioxide: A reddish-brown gas that can irritate lungs and worsen asthma.
kn: ನೈಟ್ರೋಜನ್ ಡಯಾಕ್ಸೈಡ್: ಕಂದುಬಣ್ಣದ ಅನಿಲ; ಶ್ವಾಸಕೋಶವನ್ನು ಕಿರಿಕಿರಿ ಮಾಡುತ್ತದೆ.

# o3Info
source: Ozone: A reactive gas that can damage lung tissue and exacerbate respiratory diseases.
kn: ಓಜೋನ್: ಪ್ರತಿಕ್ರಿಯಾಶೀಲ ಅನಿಲ; ಉಸಿರಾಟದ ಕಾಯಿಲೆ ತೀವ್ರಗೊಳಿಸುತ್ತದೆ.

# pm10Info
source: Particulate Matter ≤10µm: Inhalable particles that affect lungs and heart.
kn: ದಟ್ಟ ಕಣಗಳು ≤10µm: ಶ್ವಾಸಕೋಶ ಮತ್ತು ಹೃದಯದ ಮೇಲೆ ಪರಿಣಾಮ ಬೀರುತ್ತವೆ.

source: Location unavailable
kn: ಸ್ಥಳ ಮಾಹಿತಿ ಲಭ್ಯವಿಲ್ಲ

source: Unknown location
kn: ಅಪರಿಚಿತ ಸ್ಥಳ

# pm25Info
source: Particulate Matter ≤2.5µm: Fine particles that penetrate deep into lungs, dangerous for health.
kn: ಸೂಕ್ಷ್ಮ ಕಣಗಳು ≤2.5µm: ಶ್ವಾಸಕೋಶದೊಳಗೆ ಹೊಕ್ಕು ಆರೋಗ್ಯಕ್ಕೆ ಅಪಾಯಕಾರಿ.
